Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཐེག་པ་ཆེན་པོ་གང་ཡིན་པ་དང་། མི་འཇལ་བ་གང་ཡིན་པ་དང་། མི་འགྲངས་པ་གང་ཡིན་པ་དང་། མི་དཔོགས་པ་གང་ཡིན་པ་དང་། ཆོས་ཐམས་ཅད་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །རབ་འབྱོར་གཞན་ཡང་བདག་མེད་པའི་ཕྱིར། སེམས་ཅན་དང་། སྲོག་དང་། འགྲོ་བ་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་།
en: If you ask how, Subhūti, it is because beings, the real nature, space, the Great Vehicle, the unappraisable, the uncountable, the inestimable, and all phenomena are all indeed nonapprehensible. “

source: ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོ་མེད་པར་རིག་པར་བྱའོ།
en: Moreover, Subhūti, you should know that sentient beings, life forms, living beings, life, living creatures, individuals, human beings, people, agents, actors, experiencers, instigators of experience, knowers, and viewers are nonexistent because the self is nonexistent.

source: །མཐོང་བ་པོ་མེད་པའི་ཕྱིར། ཡང་དག་པའི་མཐའ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that the very limit of reality is nonexistent because viewers [and those other postulated subjects] are nonexistent.

source: །ཡང་དག་པའི་མཐའ་མེད་པའི་ཕྱིར། ནམ་མཁའ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that space is nonexistent because the very limit of reality is nonexistent.

source: །མི་དཔོགས་པ་མེད་པའི་ཕྱིར། ཆོས་ཐམས་ཅད་མེད་པར་རིག་པར་བྱའོ།
en: You should know that all phenomena are nonexistent because they are inestimable.

source: །རབ་འབྱོར་རྣམ་གྲངས་དེས་ཀྱང་ཐེག་པ་ཆེན་པོ་དེ་ནི། སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པའི་གོ་འབྱེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བདག་གང་ཡིན་པ་དང་། སེམས་ཅན་གང་ཡིན་པ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོའི་བར་དུ་གང་ཡིན་པ་དང་། ཡང་དག་པའི་མཐའ་གང་ཡིན་པ་དང་། ནམ་མཁའ་གང་ཡིན་པ་དང་།
en: Those too, Subhūti, are the formulations explaining how this Great Vehicle accommodates countless, immeasurable beings.

source: །རབ་འབྱོར་གཞན་ཡང་བདག་མེད་པའི་ཕྱིར། སེམས་ཅན་མེད་པར་རིག་པར་བྱའོ།
en: Moreover, Subhūti, you should know that beings are nonexistent because the self is nonexistent.

source: །སེམས་ཅན་མེད་པའི་ཕྱིར། ཤེས་པ་པོའི་བར་དུ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that [the other postulated subjects], up to and including knowers, are nonexistent because beings are nonexistent.

source: །ཤེས་པ་པོ་མེད་པའི་ཕྱིར། མཐོང་བ་པོ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that viewers are nonexistent because knowers are nonexistent.

source: །མཐོང་བ་པོ་མེད་པའི་ཕྱིར། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པར་རིག་པར་བྱའོ།
en: You should know that the inconceivable realm is nonexistent because viewers are nonexistent.

source: །བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པའི་ཕྱིར། གཟུགས་མེད་པར་རིག་པར་བྱའོ།
en: You should know that physical forms are nonexistent because the inconceivable realm is nonexistent.

source: །གཟུགས་མེད་པའི་ཕྱིར། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that feelings, perceptions, formative predispositions, and consciousness are nonexistent because physical forms are nonexistent.

source: །རྣམ་པར་ཤེས་པ་མེད་པའི་ཕྱིར། ནམ་མཁའ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that space is nonexistent because consciousness [and so forth] are nonexistent.

source: ཐེག་པ་ཆེན་པོ་དེ་ནི་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པའི་གོ་འབྱེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བདག་གང་ཡིན་པ་དང་། སེམས་ཅན་གང་ཡིན་པ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོའི་བར་དུ་གང་ཡིན་པ་དང་།
en: Those too, Subhūti, are the formulations explaining how this Great Vehicle accommodates countless, immeasurable beings.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས། གང་ཡིན་པ་དང་། གཟུགས་གང་ཡིན་པ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ། གང་ཡིན་པ་དང་། ནམ་མཁའ་གང་ཡིན་པ་དང་། ཐེག་པ་ཆེན་པོ་གང་ཡིན་པ་དང་། མི་འཇལ་བ་གང་ཡིན་པ་དང་། མི་འགྲངས་པ་གང་ཡིན་པ་དང་།
en: If you ask how, Subhūti, it is because the self, beings, [and the other postulated subjects], up to and including knowers and viewers, the inconceivable realm, physical forms, feelings, perceptions, formative predispositions, consciousness, space, the Great Vehicle, the unappraisable, the uncountable, the inestimable, and all phenomena are all indeed nonapprehensible. {

source: མི་དཔོགས་པ་གང་ཡིན་པ་དང་། ཆོས་ཐམས་ཅད་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །རབ་འབྱོར་གཞན་ཡང་བདག་མེད་པའི་ཕྱིར་སེམས་ཅན་མེད་པར་རིག་པར་བྱའོ།
en: Dt.238} “Moreover, Subhūti, you should know that beings are nonexistent because the self is nonexistent.

source: །བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པའི་ཕྱིར། མིག་མེད་པར་རིག་པར་བྱའོ།
en: You should know that the eyes are nonexistent because the inconceivable realm is nonexistent.

source: །མིག་མེད་པའི་ཕྱིར། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་།
en: You should know that the ears, nose, tongue, body, and mental faculty are nonexistent because the eyes are nonexistent.

source: ཡིད་མེད་པར་རིག་པར་བྱའོ། །ཡིད་མེད་པའི་ཕྱིར། ནམ་མཁའ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that space is nonexistent because the mental faculty [and so forth] are nonexistent.

source: ཐེག་པ་ཆེན་པོ་དེ་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པའི་གོ་འབྱེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བདག་གང་ཡིན་པ་དང་། སེམས་ཅན་གང་ཡིན་པ་དང་། སྲོག་གང་ཡིན་པ་དང་།
en: Those too, Subhūti, are the formulations explaining how this Great Vehicle accommodates countless, immeasurable beings.

source: ཤེས་པ་པོ་དང་། མཐོང་བ་པོའི་བར་དུ་གང་ཡིན་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་གང་ཡིན་པ་དང་། མིག་གང་ཡིན་པ་དང་། རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་གང་ཡིན་པ་དང་། ན
en: If you ask how, Subhūti, it is because the self, sentient beings, life forms, [and the other postulated subjects], up to and including knowers and viewers, the inconceivable realm, the eyes, the nose, the tongue, the body, the mental faculty, space, the Great Vehicle, the unappraisable, the uncountable, the inestimable, and all phenomena are all indeed nonapprehensible. “

source: མ་མཁའ་གང་ཡིན་པ་དང་། ཐེག་པ་ཆེན་པོ་གང་ཡིན་པ་དང་། མི་འཇལ་བ་གང་ཡིན་པ་དང་། མི་འགྲངས་པ་གང་ཡིན་པ་དང་། མི་དཔོགས་པ་གང་ཡིན་པ་དང་། ཆོས་ཐམས་ཅད་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །རབ་འབྱོར་གཞན་ཡང་བདག་མེད་པའི་ཕྱིར། སེམས་ཅན་མེད་པར་རིག་པར་བྱའོ།
en: Moreover, Subhūti, you should know that beings are nonexistent because the self is nonexistent.

source: །བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པའི་ཕྱིར། གཟུགས་མེད་པར་རིག་པར་བྱའོ། །གཟུགས་མེད་པའི་ཕྱིར།
en: You should know that sights are nonexistent because the inconceivable realm is nonexistent.

source: སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་མེད་པར་རིག་པར་བྱའོ།
en: You should know that sounds, odors, tastes, tangibles, and mental phenomena are nonexistent because sights are nonexistent.

source: །ཆོས་མེད་པའི་ཕྱིར། ནམ་མཁའ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that space is nonexistent because mental phenomena [and so forth] are nonexistent.

source: ཐེག་པ་ཆེན་པོ་དེ་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པའི་གོ་འབྱེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བདག་གང་ཡིན་པ་དང་། སེམས་ཅན་གང་ཡིན་པ་དང་། སྲོག་གང་ཡིན་པ་དང་། ཤེས་པ་པོ་དང་།
en: Those too, Subhūti, are the formulations explaining how this Great Vehicle accommodates countless, immeasurable beings.

source: མཐོང་བ་པོའི་བར་དུ་གང་ཡིན་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་གང་ཡིན་པ་དང་། གཟུགས་གང་ཡིན་པ་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་གང་ཡིན་པ་དང་། ནམ་མཁའ་གང་ཡིན་པ་དང་། ཐེག་པ་ཆེན་པོ་གང་ཡིན་པ་དང་། མི་འཇལ་བ་གང་ཡིན་པ་དང་། མི་འགྲངས་པ་གང་ཡིན་པ་དང་།
en: If you ask how, Subhūti, it is because the self, sentient beings, life forms, [and the other postulated subjects], up to and including knowers and viewers, the inconceivable realm, sights, sounds, odors, tastes, tangibles, mental phenomena, space, the Great Vehicle, the unappraisable, the uncountable, the inestimable, and all phenomena are all indeed nonapprehensible. “

source: མི་དཔོགས་པ་གང་ཡིན་པ་དང་། ཆོས་ཐམས་ཅད་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །རབ་འབྱོར་གཞན་ཡང་བདག་མེད་པའི་ཕྱིར། སེམས་ཅན་མེད་པར་རིག་པར་བྱའོ།
en: Moreover, Subhūti, you should know that beings are nonexistent because the self is nonexistent.

source: །བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པའི་ཕྱིར། །མིག་གི་རྣམ་པར་ཤེས་པ་མེད་པར་རིག་པར་བྱའོ། །མིག་གི་རྣམ་པར་ཤེས་པ་མེད་པའི་ཕྱིར།
en: You should know that visual consciousness is nonexistent because the inconceivable realm is nonexistent.

source: རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness are nonexistent because visual consciousness is nonexistent.

source: །ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་མེད་པའི་ཕྱིར། ནམ་མཁའ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that space is nonexistent because mental consciousness [and so forth] are nonexistent.

source: ཤེས་པ་པོ་དང་། མཐོང་བ་པོའི་བར་དུ་གང་ཡིན་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་གང་ཡིན་པ་དང་། མིག་གི་རྣམ་པར་ཤེས་པ་གང་ཡིན་པ་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་གང་ཡིན་པ་དང་། ནམ་མཁའ་གང་ཡིན་པ་དང་། ཐེག་པ་ཆེན་པོ་གང་ཡིན་པ་དང་། མི་འཇལ་བ་གང་ཡིན་པ་དང་། མི་འགྲངས་པ་གང་ཡིན་པ་དང་། མི་དཔོགས་པ་གང་ཡིན་པ་དང་། ཆོས་ཐམས་ཅད་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་།
en: If you ask how, Subhūti, it is because the self, sentient beings, life forms, [and the other postulated subjects], up to and including knowers and viewers, the inconceivable realm, visual consciousness, auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, mental consciousness, space, the Great Vehicle, the unappraisable, the uncountable, the inestimable, and all phenomena are all indeed nonapprehensible. “

source: དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །རབ་འབྱོར་གཞན་ཡང་བདག་མེད་པའི་ཕྱིར། སེམས་ཅན་མེད་པར་རིག་པར་བྱའོ།
en: Moreover, Subhūti, you should know that beings are nonexistent because the self is nonexistent.

source: །བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པའི་ཕྱིར། མིག་གི་འདུས་ཏེ་རེག་པ་མེད་པར་རིག་པར་བྱའོ། །མིག་གི་འདུས་ཏེ་རེག་པ་མེད་པའི་ཕྱིར།
en: You should know that visually compounded sensory contact is nonexistent because the inconceivable realm is nonexistent.

source: རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are nonexistent because visually compounded sensory contact is nonexistent.

source: །ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་མེད་པའི་ཕྱིར། ནམ་མཁའ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that space is nonexistent because mentally compounded sensory contact [and so forth] are nonexistent.

source: །རབ་འབྱོར་རྣམ་གྲངས་དེས་ཀྱང་ཐེག་པ་ཆེན་པོ་དེ་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པའི་གོ་འབྱེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བདག་གང་ཡིན་པ་དང་། སེམས་ཅན་གང་ཡིན་པ་དང་། སྲོག་གང་ཡིན་པ་དང་།
en: Those too, Subhūti, are the formulations explaining how this Great Vehicle accommodates countless, immeasurable beings.

source: ཤེས་པ་པོ་དང་། མཐོང་བ་པོའི་བར་དུ་གང་ཡིན་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་གང་ཡིན་པ་དང་། མིག་གི་འདུས་ཏེ་རེག་པ་གང་ཡིན་པ་དང་། རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་གང་ཡིན་པ་དང་། ནམ་མཁའ་གང་ཡིན་པ་དང་། ཐེག་པ་ཆེན་པོ་གང་ཡིན་པ་དང་། མི་འཇལ་བ་གང་ཡིན་པ་དང་། མི་འགྲངས་པ་གང་ཡིན་པ་དང་།
en: If you ask how, Subhūti, it is because the self, sentient beings, life forms, [and the other postulated subjects], up to and including knowers and viewers, the inconceivable realm, visually compounded sensory contact, aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, mentally compounded sensory contact, space, the Great Vehicle, the unappraisable, the uncountable, the inestimable, and all phenomena are all indeed nonapprehensible. “

source: །བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པའི་ཕྱིར། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་མེད་པར་རིག་པར་བྱའོ། །མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་མེད་པའི་ཕྱིར།
en: You should know that feelings due to sensory contact that is visually compounded are nonexistent because the inconceivable realm is nonexistent.

source: རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that feelings due to sensory contact that is aurally compounded, feelings due to sensory contact that is nasally compounded, feelings due to sensory contact that is lingually compounded, feelings due to sensory contact that is corporeally compounded, and feelings due to sensory contact that is mentally compounded are nonexistent because feelings due to sensory contact that is visually compounded are nonexistent.

source: །ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་མེད་པའི་ཕྱིར། ནམ་མཁའ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that space is nonexistent because feelings due to sensory contact that is mentally compounded [and so forth] are nonexistent.

source: །མི་ད་པོགས་པ་མེད་པའི་ཕྱིར། ཆོས་ཐམས་ཅད་མེད་པར་རིག་པར་བྱའོ།
en: You should know that all phenomena are nonexistent because they are inestimable.

source: །རབ་འབྱོར་རྣམ་གྲངས་དེས་ཀྱང་ཐེག་པ་ཆེན་པོ་དེ་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པའི་གོ་འབྱེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བདག་གང་ཡིན་པ་དང་། སེམས་ཅན་གང་ཡིན་པ་དང་། སྲོག་གང་ཡིན་པ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོའི་བར་དུ་གང་ཡིན་པ་དང་།
en: Those too, Subhūti, are the formulations explaining how this Great Vehicle accommodates countless, immeasurable beings.

source: བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་གང་ཡིན་པ་དང་། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་གང་ཡིན་པ་དང་། རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་གང་ཡིན་པ་དང་། ནམ་མཁའ་གང་ཡིན་པ་དང་། ཐེག་པ་ཆེན་པོ་གང་ཡིན་པ་དང་། མི་འཇལ་བ་གང་ཡིན་པ་དང་། མི་འགྲངས་པ་གང་ཡིན་པ་དང་།
en: If you ask how, Subhūti, it is because the self, sentient beings, life forms, [and the other postulated subjects], up to and including knowers and viewers, the inconceivable realm, feelings due to sensory contact that is visually compounded, feelings due to sensory contact that is aurally compounded, feelings due to sensory contact that is nasally compounded, feelings due to sensory contact that is lingually compounded, feelings due to sensory contact that is corporeally compounded, feelings due to sensory contact that is mentally compounded, space, the Great Vehicle, the unappraisable, the uncountable, the inestimable, and all phenomena are all indeed nonapprehensible. “

source: །བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པའི་ཕྱིར། སའི་ཁམས་མེད་པར་རིག་པར་བྱའོ། །སའི་ཁམས་མེད་པའི་ཕྱིར།
en: You should know that the earth element is nonexistent because the inconceivable realm is nonexistent.

source: ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་མེད་པར་རིག་པར་བྱའོ།
en: You should know that the water element, fire element, wind element, space element, and consciousness element are nonexistent because the earth element is nonexistent.

source: །རྣམ་པར་ཤེས་པའི་ཁམས་མེད་པའི་ཕྱིར། ནམ་མཁའ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that space is nonexistent because the consciousness element [and so forth] are nonexistent.

source: ཐེག་པ་ཆེན་པོ་དེ་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པའི་གོ་འབྱེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བདག་གང་ཡིན་པ་དང་། སེམས་ཅན་གང་ཡིན་པ་དང་། སྲོག་གང་ཡིན་པ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོའི་བར་དུ་གང་ཡིན་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་གང་ཡིན་པ་དང་། སའི་ཁམས་གང་ཡིན་པ་དང་། ཆུའི་ཁམས་དང་།
en: Those too, Subhūti, are the formulations explaining how this Great Vehicle accommodates countless, immeasurable beings.

source: མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་གང་ཡིན་པ་དང་། ནམ་མཁའ་གང་ཡིན་པ་དང་། ཐེག་པ་ཆེན་པོ་གང་ཡིན་པ་དང་། མི་འཇལ་བ་གང་ཡིན་པ་དང་། མི་འགྲངས་པ་གང་ཡིན་པ་དང་། མི་དཔོགས་པ་གང་ཡིན་པ་དང་། ཆོས་ཐམས་ཅད་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་།
en: If you ask how, Subhūti, it is because the self, sentient beings, life forms, [and the other postulated subjects], up to and including knowers and viewers, the inconceivable realm, the earth element, the water element, the fire element, the wind element, the space element, the consciousness element, space, the Great Vehicle, the unappraisable, the uncountable, the inestimable, and all phenomena are all indeed nonapprehensible. “

source: །བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པའི་ཕྱིར། མ་རིག་པ་མེད་པར་རིག་པར་བྱའོ། །མ་རིག་པ་མེད་པའི་ཕྱིར། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་།
en: You should know that ignorance is nonexistent because the inconceivable realm is nonexistent.

source: སྲིད་པ་དང་། སྐྱེ་བ་དང་། རྒ་ཤི་མེད་པར་རིག་པར་བྱའོ། །རྒ་ཤི་མེད་པའི་ཕྱིར། ནམ་མཁའ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that space is nonexistent because aging and death [and so forth] are nonexistent.

source: །མི་འགྲངས་པ་མེད་པའི་ཕྱིར། མི་ད་པོགས་པ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that phenomena are inestimable because they are uncountable.

source: ཐེག་པ་ཆེན་པོ་དེ་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པའི་གོ་འབྱེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བདག་གང་ཡིན་པ་དང་། སེམས་ཅན་གང་ཡིན་པ་དང་། སྲོག་གང་ཡིན་པ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོའི་བར་དུ་གང་ཡིན་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་གང་ཡིན་པ་དང་། མ་རིག་པ་གང་ཡིན་པ་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་།
en: Those too, Subhūti, are the formulations explaining how this Great Vehicle accommodates countless, immeasurable beings.

source: མིང་དང་གཟུགས་དང་། སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་། ཚོར་བ་དང་། སྲེད་པ་དང་། ལེན་པ་དང་། སྲིད་པ་དང་། སྐྱེ་བ་དང་། རྒ་ཤི་གང་ཡིན་པ་དང་། ནམ་མཁའ་གང་ཡིན་པ་དང་། ཐེག་པ་ཆེན་པོ་གང་ཡིན་པ་དང་། མི་འཇལ་བ་གང་ཡིན་པ་དང་། མི་འགྲངས་པ་གང་ཡིན་པ་དང་། མི་ད་པོགས་པ་གང་ཡིན་པ་དང་། ཆོས་ཐམས་ཅད་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།
en: If you ask how, Subhūti, it is because the self, sentient beings, life forms, [and the other postulated subjects], up to and including knowers and viewers, the inconceivable realm, ignorance, formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, aging and death, space, the Great Vehicle, the unappraisable, the uncountable, the inestimable, and all phenomena are all indeed nonapprehensible. “

source: བམ་པོ་ཉི་ཤུ་གཅིག་པ། རབ་འབྱོར་གཞན་ཡང་བདག་མེད་པའི་ཕྱིར། སེམས་ཅན་མེད་པར་རིག་པར་བྱའོ།
en: Moreover, Subhūti, you should know that beings are nonexistent because the self is nonexistent.

source: །སེམས་ཅན་མེད་པའི་ཕྱིར། །ཤེས་པ་པོའི་བར་དུ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that [the other postulated subjects], up to and including knowers, are nonexistent because beings are nonexistent.

source: །བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པའི་ཕྱིར། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་པར་རིག་པར་བྱའོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་པའི་ཕྱིར།
en: You should know that the perfection of generosity is nonexistent because the inconceivable realm is nonexistent.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are nonexistent because the perfection of generosity is nonexistent.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མེད་པའི་ཕྱིར། ནམ་མཁའ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that space is nonexistent because the perfection of wisdom [and so forth] are nonexistent.

source: ཤེས་པ་པོ་དང་མཐོང་བ་པོའི་བར་དུ་གང་ཡིན་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་གང་ཡིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། བས
en: If you ask how, Subhūti, it is because the self, sentient beings, life forms, [and the other postulated subjects], up to and including knowers and viewers, the inconceivable realm, the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, the perfection of wisdom, space, the Great Vehicle, the unappraisable, the uncountable, the inestimable, and all phenomena are all indeed nonapprehensible. “

source: མ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དང་། ནམ་མཁའ་གང་ཡིན་པ་དང་། ཐེག་པ་ཆེན་པོ་གང་ཡིན་པ་དང་། མི་འཇལ་བ་གང་ཡིན་པ་དང་། མི་འགྲངས་པ་གང་ཡིན་པ་དང་། མི་དཔོགས་པ་གང་ཡིན་པ་དང་། ཆོས་ཐམས་ཅད་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ། །རབ་འབྱོར་གཞན་ཡང་བདག་མེད་པའི་ཕྱིར། སེམས་ཅན་མེད་པར་རིག་པར་བྱའོ།
en: Moreover, Subhūti, you should know that beings are nonexistent because the self is nonexistent.

source: །བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པའི་ཕྱིར། ནང་སྟོང་པ་ཉིད་མེད་པར་རིག་པར་བྱའོ།
en: You should know that the emptiness of internal phenomena is nonexistent because the inconceivable realm is nonexistent.

source: །ནང་སྟོང་པ་ཉིད་མེད་པའི་ཕྱིར། ཕྱི་སྟོང་པ་ཉིད་མེད་པར་རིག་པར་བྱའོ།
en: You should know that the emptiness of external phenomena is nonexistent because the emptiness of internal phenomena is nonexistent.

source: །ཕྱི་སྟོང་པ་ཉིད་མེད་པའི་ཕྱིར། ཕྱི་ནང་སྟོང་པ་ཉིད་མེད་པར་རིག་པར་བྱའོ།
en: You should know that the emptiness of external and internal phenomena is nonexistent because the emptiness of external phenomena is nonexistent.

source: །ཕྱི་ནང་སྟོང་པ་ཉིད་མེད་པའི་ཕྱིར། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are nonexistent because the emptiness of external and internal phenomena is nonexistent.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་མེད་པའི་ཕྱིར། ནམ་མཁའ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that space is nonexistent because the emptiness of the essential nature of nonentities [and so forth] are nonexistent.

source: །རབ་འབྱོར་རྣམ་གྲངས་དེས་ཀྱང་ཐེག་པ་ཆེན་པོ་དེ་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པའི་གོ་འབྱེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བདག་གང་ཡིན་པ་དང་། སེམས་ཅན་གང་ཡིན་པ་དང་། སྲོག་གང་ཡིན་པ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོའི་བར་དུ་གང་ཡིན་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་གང་ཡིན་པ་དང་། ནང་སྟོང་པ་ཉིད་གང་ཡིན་པ་དང་། ཕྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དང་།
en: Those too, Subhūti, are the formulations explaining how this Great Vehicle accommodates countless, immeasurable beings.

source: ཕྱི་ནང་སྟོང་པ་ཉིད་གང་ཡིན་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་གང་ཡིན་པ་དང་། ནམ་མཁའ་གང་ཡིན་པ་དང་། ཐེག་པ་ཆེན་པོ་གང་ཡིན་པ་དང་། མི་འཇལ་བ་གང་ཡིན་པ་དང་། མི་འགྲངས་པ་གང་ཡིན་པ་དང་།
en: If you ask how, Subhūti, it is because the self, sentient beings, life forms, [and the other postulated subjects], up to and including knowers and viewers, the inconceivable realm, the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of external and internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, space, the Great Vehicle, the unappraisable, the uncountable, the inestimable, and all phenomena are all indeed nonapprehensible. “

source: །བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་མེད་པའི་ཕྱིར། དྲན་པ་ཉེ་བར་གཞག་པ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that the applications of mindfulness are nonexistent because the inconceivable realm is nonexistent.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་མེད་པའི་ཕྱིར། ཡང་དག་པར་སྤོང་བ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that the correct exertions are nonexistent because the applications of mindfulness are nonexistent.

source: །ཡང་དག་པར་སྤོང་བ་མེད་པའི་ཕྱིར། རྫུ་འཕྲུལ་གྱི་རྐང་པ་མེད་པར་རིག་པར་བྱའོ།
en: You should know that the supports for miraculous ability are nonexistent because the correct exertions are nonexistent.
